local alpha = require("alpha")
local dashboard = require("alpha.themes.dashboard")

dashboard.section.header.val = {
  "                                                                       ",
  "                                                                     ",
  "       ████ ██████           █████      ██                     ",
  "      ███████████             █████                             ",
  "      █████████ ███████████████████ ███   ███████████   ",
  "     █████████  ███    █████████████ █████ ██████████████   ",
  "    █████████ ██████████ █████████ █████ █████ ████ █████   ",
  "  ███████████ ███    ███ █████████ █████ █████ ████ █████  ",
  " ██████  █████████████████████ ████ █████ █████ ████ ██████ ",
  "                                                                       ",
}

dashboard.section.header.opts.hl = "Title"

dashboard.section.buttons.val = {
  dashboard.button("e", "  > New file", ":ene <BAR> startinsert <CR>"),
  dashboard.button("r", "󰈚  > Recent", ":RecentFilesPicker<CR>"),
  dashboard.button(
    "f",
    "󰈞  > Find C project",
    ":cd $HOME/probe/c | DirsPicker<CR>"
  ),
  dashboard.button("s", "  > Config", ":ConfigFilesPicker<CR>"),
  dashboard.button("p", "  > Plugins", "<cmd>Lazy<cr>"),
  dashboard.button("h", "  > Checkhealth", "<cmd>checkhealth<cr>"),
  dashboard.button("q", "  > Quit NVIM", ":qa<CR>"),
}

alpha.setup(dashboard.opts)

vim.cmd([[
    autocmd FileType alpha setlocal nofoldenable
]])
